mamedev/mame/src/devices/cpu/pic16x8x/pic16x8x.cpp
// license:BSD-3-Clause
// copyright-holders:Grull Osgo
/****************************************************************************************

  Microchip PIC16x8x Emulator

  https://ww1.microchip.com/downloads/en/DeviceDoc/30445D.pdf
  
  Based on MAME's PIC16C5x/62x cpu devices developed by Tony La Porta
  and improvements to SFR's accesss made by ajrhacker.

  Preliminary version to give support to magicle and other games
  on misc/magicard.cpp driver, providing some protection level via I2C bus.

  Coded and partially tested:
    - All instruction set and disassembler.
    - I/O Ports.
    - WDT.
    - Timer/Counter.
    - All (4) interrupt sources.
    - Input lines.
    - Internal EEPROM with default and NVRAM functionality.

 ToDo:
    - Verify if data ram addreess map mirroring is properly coded acording to datasheet description.

    - Choose wich is the best option to set the config word, if via set instruction or from dump data or some sort of combination via default options.

	- Improve the debug section.
	
	- Verify eeprom write sequence (see datashhet) 

  Improvements:
    - SFR's Flag description (bit oriented instructions) in disassembler where possible.

****************************************************************************************/

#include "emu.h"
#include "pic16x8x.h"
#include "16x8xdsm.h"

DEFINE_DEVICE_TYPE(PIC16CR83, pic16cr83_device, "pic16cr83", "Microchip PIC16CR83")
DEFINE_DEVICE_TYPE(PIC16CR84, pic16cr84_device, "pic16cr84", "Microchip PIC16CR84")
DEFINE_DEVICE_TYPE(PIC16F83,  pic16f83_device,  "pic16f83",  "Microchip PIC16F83")
DEFINE_DEVICE_TYPE(PIC16F84,  pic16f84_device,  "pic16f84",  "Microchip PIC16F84")
DEFINE_DEVICE_TYPE(PIC16F84A, pic16f84a_device, "pic16f84a", "Microchip PIC16F84A")

/****************************************************************************
 *  Internal Memory Maps
 ****************************************************************************/

void pic16x8x_device::rom_9(address_map &map)
{
	map(0x000, 0x1ff).rom();
}

void pic16x8x_device::rom_10(address_map &map)
{
	map(0x000, 0x3ff).rom();
}


/* Notes from datasheet:
 The address depends on the device used.
Devices with 36 bytes ends at 2Fh, devices with
68 bytes ends at 4Fh.*/

void pic16x8x_device::core_regs(address_map &map, u8 mirror)
{
	map(0x00, 0x00).noprw().mirror(mirror); // Not an actual register, reading indirectly (FSR=0) returns 0
	map(0x01, 0x01).rw(FUNC(pic16x8x_device::tmr0_r), FUNC(pic16x8x_device::tmr0_w));
	map(0x02, 0x02).rw(FUNC(pic16x8x_device::pcl_r), FUNC(pic16x8x_device::pcl_w)).mirror(mirror);
	map(0x03, 0x03).rw(FUNC(pic16x8x_device::status_r), FUNC(pic16x8x_device::status_w)).mirror(mirror);
	map(0x04, 0x04).rw(FUNC(pic16x8x_device::fsr_r), FUNC(pic16x8x_device::fsr_w)).mirror(mirror);
	map(0x05, 0x05).rw(FUNC(pic16x8x_device::porta_r), FUNC(pic16x8x_device::porta_w));
	map(0x06, 0x06).rw(FUNC(pic16x8x_device::portb_r), FUNC(pic16x8x_device::portb_w));
	map(0x07, 0x07).noprw().mirror(mirror); // Not an actual register, returns 0
	map(0x08, 0x08).rw(FUNC(pic16x8x_device::eedata_r), FUNC(pic16x8x_device::eedata_w));
	map(0x09, 0x09).rw(FUNC(pic16x8x_device::eeadr_r), FUNC(pic16x8x_device::eeadr_w));
	map(0x0a, 0x0a).rw(FUNC(pic16x8x_device::pclath_r), FUNC(pic16x8x_device::pclath_w)).mirror(mirror);
	map(0x0b, 0x0b).rw(FUNC(pic16x8x_device::intcon_r), FUNC(pic16x8x_device::intcon_w)).mirror(mirror);
	map(0x81, 0x81).rw(FUNC(pic16x8x_device::option_r), FUNC(pic16x8x_device::option_w));
	map(0x85, 0x85).rw(FUNC(pic16x8x_device::trisa_r), FUNC(pic16x8x_device::trisa_w));
	map(0x86, 0x86).rw(FUNC(pic16x8x_device::trisb_r), FUNC(pic16x8x_device::trisb_w));
	map(0x88, 0x88).rw(FUNC(pic16x8x_device::eecon1_r), FUNC(pic16x8x_device::eecon1_w));
	map(0x89, 0x89).rw(FUNC(pic16x8x_device::eecon2_r), FUNC(pic16x8x_device::eecon2_w));
}

void pic16x8x_device::ram_6(address_map &map)
{
	// 0x00 - 0x0b SFR's Bank 0
	// 0x0c - 0x2f GPR's
	// 0x80 - 0x8b SFR's Bank 1
	// 0x8c - 0xaf GPR Mirrored to 0x0c - 0x2f
	core_regs(map, 0x80);
	map(0x0c, 0x2f).ram().mirror(0x80);
}

void pic16x8x_device::ram_7(address_map &map)
{
	// 0x00 - 0x0b SFR's Bank 0
	// 0x0c - 0x4f GPR's
	// 0x80 - 0x8b SFR's Bank 1
	// 0x8c - 0xcf GPR Mirrored to 0x0c - 0x4f
	core_regs(map, 0x80);
	map(0x0c, 0x4f).ram().mirror(0x80);
}


pic16x8x_device::pic16x8x_device(const machine_config &mconfig, device_type type, const char *tag, device_t *owner, u32 clock, int program_width)
	: cpu_device(mconfig, type, tag, owner, clock)
	, device_nvram_interface(mconfig, *this)
	, m_region(*this, DEVICE_SELF)
	, m_program_config("program", ENDIANNESS_LITTLE, 16, program_width, -1,
		((program_width == 9) ? address_map_constructor(FUNC(pic16x8x_device::rom_9), this) :  address_map_constructor(FUNC(pic16x8x_device::rom_10),this)))
	, m_data_config("data", ENDIANNESS_LITTLE, 8, 8, 0,
		((program_width == 9) ? address_map_constructor(FUNC(pic16x8x_device::ram_6), this) :  address_map_constructor(FUNC(pic16x8x_device::ram_7), this)))
	, m_CONFIG(0x3fff)
	, m_program_width(program_width)
	, m_read_port(*this, 0)
	, m_write_port(*this)
{
}	


pic16cr83_device::pic16cr83_device(const machine_config &mconfig, const char *tag, device_t *owner, u32 clock)
	: pic16x8x_device(mconfig, PIC16CR83, tag, owner, clock, 9)
{
}

pic16cr84_device::pic16cr84_device(const machine_config &mconfig, const char *tag, device_t *owner, u32 clock)
	: pic16x8x_device(mconfig, PIC16CR84, tag, owner, clock, 10)
{
}

pic16f83_device::pic16f83_device(const machine_config &mconfig, const char *tag, device_t *owner, u32 clock)
	: pic16x8x_device(mconfig, PIC16F83, tag, owner, clock, 9)
{
}

pic16f84_device::pic16f84_device(const machine_config &mconfig, const char *tag, device_t *owner, u32 clock)
	: pic16x8x_device(mconfig, PIC16F84, tag, owner, clock, 10)
{
}

pic16f84a_device::pic16f84a_device(const machine_config &mconfig, const char *tag, device_t *owner, u32 clock)
	: pic16x8x_device(mconfig, PIC16F84A, tag, owner, clock, 10)
{
}

device_memory_interface::space_config_vector pic16x8x_device::memory_space_config() const
{
	return space_config_vector
	{
		std::make_pair(AS_PROGRAM, &m_program_config),
		std::make_pair(AS_DATA,    &m_data_config)
	};
}

