mamedev/mame/src/devices/cpu/pic16x8x/pic16x8x.cpp
std::unique_ptr<util::disasm_interface> pic16x8x_device::create_disassembler()
{
	return std::make_unique<pic16x8x_disassembler>();
}


/* Notes about NVRAM / PIC eeprom data

Dump size is 4280 Bytes, 16 bits wide.
0000h-03ffh is program data
0400h-3fffh is dummy data
4000h-400fh is user and config data
4010h-41ffh is dummy data
4200h-4280h is eeprom data

NVRAM saved data is 8 bits wide, in accordance with the data width
of the EEPROM memory of the PIC.
This means that we need to perform the conversion from the default
NVRAM dumped data to the NVRAM saved data.
*/

void pic16x8x_device::nvram_default()
{
	u16 dump_size = 0x4280;
	u16 eeprom_dump = 0x4200;

	// populate from a memory region if present
	if (m_region.found())
	{
		if( m_region->bytes() != dump_size ) // pic memory dump total size
		{
			fatalerror( "Region '%s' wrong size (expected size = 0x%X)\n", tag(), dump_size );
		}

		if( m_region->bytewidth() != 2 ) // pic memory dumps are 16 bits wide
		{
			fatalerror( "Region '%s' needs to be an 16-bit region\n", tag() );
		}

		// Get default NVRAM data from memory region
		memcpy(m_buff, m_region->base() + eeprom_dump, m_internal_eeprom_size * 2);

		// Data width conversion
		for (u8 i=0; i < m_internal_eeprom_size; i++)
			m_eeprom_data[i] = m_buff[i] & 0x00ff;
	}

}

bool pic16x8x_device::nvram_read(util::read_stream &file)
{
	auto const [err, actual] = read(file, m_eeprom_data, m_internal_eeprom_size);
	return !err && (actual == m_internal_eeprom_size);
}

bool pic16x8x_device::nvram_write(util::write_stream &file)
{
	auto const [err, actual] = write(file, m_eeprom_data, m_internal_eeprom_size);
	return !err && (actual == m_internal_eeprom_size);
}


// EEPROM data access
u8 pic16x8x_device::m_eeread(offs_t offs)
{
	return m_eeprom_data[offs];
}

void pic16x8x_device::m_eewrite(offs_t offs, u8 data)
{
	m_eeprom_data[offs] = data & m_data_mask;
}


// ******** The following is the STATUS flag register definition. ********
// |  7  |  6  |  5  | 4 | 3 | 2 |  1 | 0 |
// | IRP | RP1 | RP0 | T0| PD| Z | DC | C |

// IRP Register Bank Select - Unimplemented on this device
constexpr u8 RP1_FLAG = 0x40;  // Register Bank Select Bit 1
constexpr u8 RP0_FLAG = 0x20;  // Register Bank Select Bit 0
							  // 00 = Bank 0 (00h-7fh)
							  // 01 = Bank 1 (80h-ffh)
							  // 10 = Bank 2 (100h-17fh)
							  // 11 = Bank 3 (180h-1ffh)
							  // Each bank is 128 bytes. Only bit RP0 is used by the PIC16F8X. RP1 should be mantained clear.
constexpr u8 TO_FLAG  = 0x10;  // TO   Time Out flag (WatchDog)
constexpr u8 PD_FLAG  = 0x08;  // PD   Power Down flag
constexpr u8 Z_FLAG   = 0x04;  // Z    Zero Flag
constexpr u8 DC_FLAG  = 0x02;  // DC   Digit Carry/Borrow flag (Nibble)
constexpr u8 C_FLAG   = 0x01;  // C    Carry/Borrow Flag (Byte)

#define RP0     (m_STATUS & RP0_FLAG)
#define TO      (m_STATUS & TO_FLAG)
#define PD      (m_STATUS & PD_FLAG)
#define ZERO    (m_STATUS & Z_FLAG)
#define DC      (m_STATUS & DC_FLAG)
#define CARRY   (m_STATUS & C_FLAG)


// ******** The following is the OPTION flag register definition. ********
// |   7  |    6   |   5  |   4  |  3  |   2 |   1 |   0 |
// | RBPU | INTEDG | T0CS | T0SE | PSA | PS2 | PS1 | PS0 |
constexpr u8 RBPU_FLAG   = 0x80;  // RBPU PORTB Pull-up Enable bit
constexpr u8 INTEDG_FLAG = 0x40;  // INTEDG  Interrupt Edge Select bit
								 // 1 = Interrupt on rising edge of RB0/INT pin
								 // 0 = Interrupt on falling edge of RB0/INT pin
constexpr u8 T0CS_FLAG   = 0x20;  // T0CS Timer 0 clock source select
								 // 1 = Transition on RA4/T0CKI pin
								 // 0 = Internal instruction cycle clock (CLKOUT)
constexpr u8 T0SE_FLAG   = 0x10;  // T0SE Timer 0 clock source edge select
								 // 1 = Increment on high-to-low transition on RA4/T0CKI pin
								 // 0 = Increment on low-to-high transition on RA4/T0CKI pin
constexpr u8 PSA_FLAG    = 0x08;  // PSA Prescaler Assignment bit
								 // 1 = Prescaler is assigned to the WDT
								 // 0 = Prescaler is assigned to the Timer0 module
constexpr u8 PS_REG      = 0x07;  // PS Prescaler Rate select

#define RBPU    (m_OPTION & RBPU_FLAG)
#define INTEDG  (m_OPTION & INTEDG_FLAG)
#define T0CS    (m_OPTION & T0CS_FLAG)
#define T0SE    (m_OPTION & T0SE_FLAG)
#define PSA     (m_OPTION & PSA_FLAG)
#define PS      (m_OPTION & PS_REG)


// ******** The following is the CONFIG Flag register definition. ********
// | 11 | 10 | 9 | 8 | 7 | 6 | 5 | 4 | 3 |   2  | 1 | 0 |
// |              CP                     | WDTE |  FOSC |
							// CP       Code Protect (ROM read protect)
constexpr u8 WDTE_FLAG  = 0x04;  // WDTE     WatchDog Timer enable
constexpr u8 FOSC_FLAG  = 0x03;  // FOSC     Oscillator source select

#define WDTE    (m_CONFIG & WDTE_FLAG)
#define FOSC    (m_CONFIG & FOSC_FLAG)


// ******** The following is the INTCON flag register definition. ********
// |   7 |   6  |   5  |   4  |   3  |   2  |   1  |   0  |
// | GIE | EEIE | T0IE | INTE | RBIE | T0IF | INTF | RBIF |

constexpr u8 GIE_FLAG  = 0x80;
constexpr u8 EEIE_FLAG = 0x40;
constexpr u8 T0IE_FLAG = 0x20;
constexpr u8 INTE_FLAG = 0x10;
constexpr u8 RBIE_FLAG = 0x08;
constexpr u8 T0IF_FLAG = 0x04;
constexpr u8 INTF_FLAG = 0x02;
constexpr u8 RBIF_FLAG = 0x01;

#define GIE   (m_INTCON & GIE_FLAG)
#define EEIE  (m_INTCON & EEIE_FLAG)
#define T0IE  (m_INTCON & T0IE_FLAG)
#define INTE  (m_INTCON & INTE_FLAG)
#define RBIE  (m_INTCON & RBIE_FLAG)
#define T0IF  (m_INTCON & T0IF_FLAG)
#define INTF  (m_INTCON & INTF_FLAG)
#define RBIF  (m_INTCON & RBIF_FLAG)

// ******** The following is the EECON1 Flag register definition. ********
// | 7 | 6 | 5 |   4  |   3   |   2  |  1 |  0 |
// |   |   |   | EEIF | WRERR | WREN | WR | RD |

constexpr u8 EEIF_FLAG  = 0x10;
constexpr u8 WRERR_FLAG = 0x08;
constexpr u8 WREN_FLAG  = 0x04;
constexpr u8 EEWR_FLAG  = 0x02;
constexpr u8 EERD_FLAG  = 0x01;

