mamedev/mame/src/devices/cpu/pic16x8x/pic16x8x.cpp
#define EEIF  (m_EECON1 & EEIF_FLAG)
#define WRERR (m_EECON1 & WRERR_FLAG)
#define WREN  (m_EECON1 & WREN_FLAG)
#define EEWR  (m_EECON1 & EEWR_FLAG)
#define EERD  (m_EECON1 & EERD_FLAG)

/************************************************************************
 *  Fixed Vectors
 ************************************************************************/

constexpr u8 RESET_VECTOR = 0x00;
constexpr u8 INT_VECTOR   = 0x04;

/************************************************************************
 *  Shortcuts
 ************************************************************************/

#define RISING_EDGE_RB0   (( (int)(RB0_in - m_old_RB0) > 0) ? 1 : 0)
#define FALLING_EDGE_RB0  (( (int)(RB0_in - m_old_RB0) < 0) ? 1 : 0)

//#define S_RB0_IN          (m_read_port[PORTB](PORTB, 0x01))

#define M_RDEEPROM(A)     m_eeread(A)
#define M_WREEPROM(A,V)   m_eewrite(A, V)

#define CLR(flagreg, flag)  (flagreg &= u8(~flag))
#define SET(flagreg, flag)  (flagreg |= (flag))

#define ADDR  ((m_opcode.b.l & 0x7f) | (RP0 << 2))
#define BITPOS  ((m_opcode.w >> 7) & 7)


void pic16x8x_device::calc_zero_flag()
{
	if (m_ALU == 0)
		SET(m_STATUS, Z_FLAG);
	else
		CLR(m_STATUS, Z_FLAG);
}

void pic16x8x_device::calc_add_flags(u8 augend)
{
	calc_zero_flag();

	if (augend > m_ALU)
		SET(m_STATUS, C_FLAG);
	else
		CLR(m_STATUS, C_FLAG);

	if ((augend & 0x0f) > (m_ALU & 0x0f))
		SET(m_STATUS, DC_FLAG);
	else
		CLR(m_STATUS, DC_FLAG);
}

void pic16x8x_device::calc_sub_flags(u8 minuend)
{
	calc_zero_flag();

	if (minuend < m_ALU)
		CLR(m_STATUS, C_FLAG);
	else
		SET(m_STATUS, C_FLAG);

	if ((minuend & 0x0f) < (m_ALU & 0x0f))
		CLR(m_STATUS, DC_FLAG);
	else
		SET(m_STATUS, DC_FLAG);
}

void pic16x8x_device::set_pc(u16 addr)
{
	m_PCL = addr & m_program_mask;
}

/*
Notes about Stack (from datasheet)
After the stack has been PUSHed eight times, the ninth
push overwrites the value that was stored from the first
push. The tenth push overwrites the second push (and
so on)
*/

u16 pic16x8x_device::pop_stack()
{
	m_stack_pointer = (m_stack_pointer - 1) & 0x0f;
	u16 data = m_STACK[m_stack_pointer];
	return data & m_program_mask;
}

void pic16x8x_device::push_stack(u16 data)
{
	m_STACK[m_stack_pointer] = data & m_program_mask;
	m_stack_pointer = (m_stack_pointer + 1) & 0x0f;
}

void pic16x8x_device::store_result(u8 addr, u8 data)
{
	if (m_opcode.b.l & 0x80)
		store_regfile(addr, data);
	else
		m_W = data;

}

// *** Special function registers (SFR's) ***

// ***            SFR Access              ***
u8 pic16x8x_device::get_regfile(u8 addr)
{
	if (addr == 0)
	{ // Indirect addressing
		addr = m_FSR & m_data_mask;
	}
	return m_data.read_byte(addr);
}

void pic16x8x_device::store_regfile(u8 addr, u8 data)
{
	if (addr == 0)
	{ // Indirect addressing
		addr = m_FSR & m_data_mask;
	}
	m_data.write_byte(addr, data);
}

// ***            SFR Functions          ***
u8 pic16x8x_device::tmr0_r()
{
	return m_TMR0;
}

void pic16x8x_device::tmr0_w(u8 data)
{
	m_delay_timer = 2; // Timer increment is inhibited for 2 cycles
	if (PSA == 0) m_prescaler = 0; // Must clear the Prescaler
	m_TMR0 = data;
}

u8 pic16x8x_device::pcl_r()
{
	return m_PCL;
}

void pic16x8x_device::pcl_w(u8 data)
{
	m_PCL = data;
	set_pc((m_PCLATH << 8) | data);
	m_inst_cycles++;
}

u8 pic16x8x_device::status_r()
{
	return m_STATUS;
}

void pic16x8x_device::status_w(u8 data)
{
	m_STATUS = (m_STATUS & (TO_FLAG | PD_FLAG)) | (data & u8(~(TO_FLAG | PD_FLAG)));
}

u8 pic16x8x_device::fsr_r()
{
	return m_FSR | (uint8_t)(~m_data_mask);
}

void pic16x8x_device::fsr_w(u8 data)
{
	m_FSR = data | u8(~m_data_mask);
}

u8 pic16x8x_device::porta_r()
{
	u8 data = m_read_port[PORTA](PORTA, 0xff);
	data &= m_port_tris[PORTA];
	data |= (u8(~m_port_tris[PORTA]) & m_port_data[PORTA]);
	return data & 0x1f; // 5-bit port (only lower 5 bits used)
}

void pic16x8x_device::porta_w(u8 data)
{
	data &= 0x1f; // 5-bit port (only lower 5 bits used)
	m_write_port[PORTA](PORTA, data & u8(~m_port_tris[PORTA]) & 0x1f, u8(~m_port_tris[PORTA]) & 0x1f);
	m_port_data[PORTA] = data;
}

u8 pic16x8x_device::portb_r()
{
	u8 data = m_read_port[PORTB](PORTB, 0xff);
	data &= m_port_tris[PORTB];
	data |= (u8(~m_port_tris[PORTB]) & m_port_data[PORTB]);
	return  data;
}

void pic16x8x_device::portb_w(u8 data)
{
	m_write_port[PORTB](PORTB, data & u8(~m_port_tris[PORTB]), u8(~m_port_tris[PORTB]));
	m_port_data[PORTB] = data;
}

u8 pic16x8x_device::eedata_r()
{
	return m_EEDATA;
}

void pic16x8x_device::eedata_w(u8 data)
{
	m_EEDATA = data;
}

u8 pic16x8x_device::eeadr_r()
{
	return m_EEADR;
}

void pic16x8x_device::eeadr_w(u8 data)
{
	m_EEADR = data;
}

u8 pic16x8x_device::pclath_r()
{
	return m_PCLATH;
}

void pic16x8x_device::pclath_w(u8 data)
{
	m_PCLATH = data;
}

u8 pic16x8x_device::intcon_r()
{
	return m_INTCON;
}

void pic16x8x_device::intcon_w(u8 data)
{
	m_INTCON = data;
}

u8 pic16x8x_device::trisa_r()
{
	return m_port_tris[PORTA];
}

void pic16x8x_device::trisa_w(u8 data)
{
	if (m_port_tris[PORTA] != data)
	{
		m_port_tris[PORTA] = data | 0xe0;
		m_write_port[PORTA](PORTA, m_port_data[PORTA] & u8(~m_port_tris[PORTA]) & 0x1f, u8(~m_port_tris[PORTA]) & 0x1f);
	}
}

u8 pic16x8x_device::trisb_r()
{
	return m_port_tris[PORTB];
}

void pic16x8x_device::trisb_w(u8 data)
{
	if (m_port_tris[PORTB] != data)
	{
		m_port_tris[PORTB] = data;
		m_write_port[PORTB](PORTB, m_port_data[PORTB] & u8(~m_port_tris[PORTB]), u8(~m_port_tris[PORTB]));
	}
}

u8 pic16x8x_device::eecon1_r()
{
	return  m_EECON1;
}

void pic16x8x_device::eecon1_w(u8 data)
{
	if (!((data & WREN_FLAG) && EEWR))  // The WR bit will be inhibited from being set unless the WREN bit is set.(from datasheet)
		CLR(data, EEWR);                // Clear the flag if it don't meet the requirements

	m_EECON1 = data;                    // update register

	if (EERD)                           // cheack flag condition to read eeprom
	{
		m_EEDATA = M_RDEEPROM(m_EEADR); // do eeprom read
		CLR(m_EECON1, EERD_FLAG);       // clear read enable flag
	}

	if (WREN && EEWR && (m_EECON2 == 0xff)) // check flags conditions to write eeprom
	{
		M_WREEPROM(m_EEADR, data);          // do eeprom write
		CLR(m_EECON1, EEWR_FLAG);           // clear write enable flag
		SET(m_EECON1, EEIF_FLAG);           // assuming write was done, set EEIF
	}
}

