mamedev/mame/src/devices/cpu/pic16x8x/pic16x8x.cpp
u8 pic16x8x_device::eecon2_r()
{
	return m_EECON2;
}

void pic16x8x_device::eecon2_w(u8 data)
{
	if((m_EECON2!=0x55) & (data==0x55))
		m_EECON2 = data;
	else if((m_EECON2==0x55) & (data==0xAA))
		m_EECON2 = 0xff;
	else
		m_EECON2 = data;
}

u8 pic16x8x_device::option_r()
{
	return m_OPTION;
}

void pic16x8x_device::option_w(u8 data)
{
	m_OPTION = data;
}

/************************************************************************
 *  Emulate the Instructions
 ************************************************************************/

void pic16x8x_device::illegal()
{
	logerror("PIC16x8x: PC=%03x, Illegal opcode = %04x\n", m_PREVPC, m_opcode.w);
}

/*
    Note:
    According to the manual, if the STATUS register is the destination for an instruction that affects the Z, DC or C bits
    then the write to these three bits is disabled. These bits are set or cleared according to the device logic.
    To ensure this is correctly emulated, in instructions that write to the file registers, always change the status flags
    *after* storing the result of the instruction.
    e.g. CALCULATE_*, SET(STATUS,*_FLAG) and CLR(STATUS,*_FLAG) should appear as the last steps of the instruction emulation.
*/

void pic16x8x_device::addlw()
{
	// New
	m_ALU = m_opcode.b.l + m_W;
	m_W = m_ALU;
	calc_zero_flag();
}

void pic16x8x_device::addwf()
{
	u8 augend = get_regfile(ADDR);
	m_ALU = augend + m_W;
	store_result(ADDR, m_ALU);
	calc_add_flags(augend);
}

void pic16x8x_device::andlw()
{
	m_ALU = m_opcode.b.l & m_W;
	m_W = m_ALU;
	calc_zero_flag();
}

void pic16x8x_device::andwf()
{
	m_ALU = get_regfile(ADDR) & m_W;
	store_result(ADDR, m_ALU);
	calc_zero_flag();
}

void pic16x8x_device::bcf()
{
	m_ALU = get_regfile(ADDR);
	m_ALU &= ~(1 << BITPOS);
	store_regfile(ADDR, m_ALU);
}

void pic16x8x_device::bsf()
{
	m_ALU = get_regfile(ADDR);
	m_ALU |= 1 << BITPOS;
	store_regfile(ADDR, m_ALU);
}

void pic16x8x_device::btfss()
{
	if (BIT(get_regfile(ADDR), BITPOS))
	{
		set_pc(m_PCL + 1);
		m_inst_cycles++; // Add NOP cycles
	}
}

void pic16x8x_device::btfsc()
{
	if (!BIT(get_regfile(ADDR), BITPOS))
	{
		set_pc(m_PCL + 1);
		m_inst_cycles++; // Add NOP cycles
	}
}

void pic16x8x_device::call()
{
	push_stack(m_PCL);
	set_pc(((m_PCLATH & 0x18) << 8 ) | (m_opcode.w & 0x07ff));
}


void pic16x8x_device::clrw()
{
	m_W = 0;
	SET(m_STATUS, Z_FLAG);
}

void pic16x8x_device::clrf()
{
	store_regfile(ADDR, 0);
	SET(m_STATUS, Z_FLAG);
}

void pic16x8x_device::clrwdt()
{
	m_WDT = 0;
	if (PSA) m_prescaler = 0;
	SET(m_STATUS, TO_FLAG);
	SET(m_STATUS, PD_FLAG);
}

void pic16x8x_device::comf()
{
	m_ALU = u8(~(get_regfile(ADDR)));
	store_result(ADDR, m_ALU);
	calc_zero_flag();
}

void pic16x8x_device::decf()
{
	m_ALU = get_regfile(ADDR) - 1;
	store_result(ADDR, m_ALU);
	calc_zero_flag();
}

void pic16x8x_device::decfsz()
{
	m_ALU = get_regfile(ADDR) - 1;
	store_result(ADDR, m_ALU);
	if (m_ALU == 0)
	{
		set_pc(m_PCL + 1);
		m_inst_cycles++; // Add NOP cycles
	}
}

void pic16x8x_device::goto_op()
{
	set_pc(((m_PCLATH & 0x18) << 8 ) | (m_opcode.w & 0x07ff));
}

void pic16x8x_device::incf()
{
	m_ALU = get_regfile(ADDR) + 1;
	store_result(ADDR, m_ALU);
	calc_zero_flag();
}

void pic16x8x_device::incfsz()
{
	m_ALU = get_regfile(ADDR) + 1;
	store_result(ADDR, m_ALU);
	if (m_ALU == 0)
	{
		set_pc(m_PCL + 1);
		m_inst_cycles++; // Add NOP cycles
	}
}

void pic16x8x_device::iorlw()
{
	m_ALU = m_opcode.b.l | m_W;
	m_W = m_ALU;
	calc_zero_flag();
}

void pic16x8x_device::iorwf()
{
	m_ALU = get_regfile(ADDR) | m_W;
	store_result(ADDR, m_ALU);
	calc_zero_flag();
}

void pic16x8x_device::movf()
{
	m_ALU = get_regfile(ADDR);
	store_result(ADDR, m_ALU);
	calc_zero_flag();
}

void pic16x8x_device::movlw()
{
	m_W = m_opcode.b.l;
}

void pic16x8x_device::movwf()
{
	store_regfile(ADDR, m_W);
}

void pic16x8x_device::nop()
{
	// Do nothing
}

void pic16x8x_device::retfie()  // new for 16x8x
{
	// New
	set_pc(pop_stack());
	m_irq_in_progress = false;
}

void pic16x8x_device::retlw()
{
	m_W = m_opcode.b.l;
	set_pc(pop_stack());
}

void pic16x8x_device::retrn()   // new for 16x8x
{
	set_pc(pop_stack());
}

void pic16x8x_device::rlf()
{
	m_ALU = get_regfile(ADDR);
	int carry = BIT(m_ALU, 7);
	m_ALU <<= 1;
	if (m_STATUS & C_FLAG) m_ALU |= 1;
	store_result(ADDR, m_ALU);

	if (carry)
		SET(m_STATUS, C_FLAG);
	else
		CLR(m_STATUS, C_FLAG);
}

void pic16x8x_device::rrf()
{
	m_ALU = get_regfile(ADDR);
	int carry = BIT(m_ALU, 0);
	m_ALU >>= 1;
	if (m_STATUS & C_FLAG) m_ALU |= 0x80;
	store_result(ADDR, m_ALU);

	if (carry)
		SET(m_STATUS, C_FLAG);
	else
		CLR(m_STATUS, C_FLAG);
}

void pic16x8x_device::sleepic()
{
	if (WDTE) m_WDT = 0;
	if (PSA) m_prescaler = 0;
	SET(m_STATUS, TO_FLAG);
	CLR(m_STATUS, PD_FLAG);
}

void pic16x8x_device::sublw()   // new for 16x8x : Substract W from literal
{
	// New
	u8 minuend = m_opcode.b.l;
	m_ALU = minuend - m_W;
	m_W = m_ALU;
	calc_sub_flags(minuend);
}

void pic16x8x_device::subwf()  // Substract W from f
{
	u8 minuend = get_regfile(ADDR);
	m_ALU = minuend - m_W;
	store_result(ADDR, m_ALU);
	calc_sub_flags(minuend);
}

void pic16x8x_device::swapf()
{
	u8 reg = get_regfile(ADDR);
	m_ALU = reg << 4 | reg >> 4;
	store_result(ADDR, m_ALU);
}

void pic16x8x_device::xorlw()
{
	m_ALU = m_W ^ m_opcode.b.l;
	m_W = m_ALU;
	calc_zero_flag();
}

void pic16x8x_device::xorwf()
{
	m_ALU = get_regfile(ADDR) ^ m_W;
	store_result(ADDR, m_ALU);
	calc_zero_flag();
}


/***********************************************************************
 *  Opcode Table (Cycles, Instruction)
 ***********************************************************************/

const pic16x8x_device::pic16x8x_opcode pic16x8x_device::s_opcode_main[128]=
{
	{1, &pic16x8x_device::nop     },{1, &pic16x8x_device::movwf   },{1, &pic16x8x_device::clrw    },{1, &pic16x8x_device::clrf    }, // 00
	{1, &pic16x8x_device::subwf   },{1, &pic16x8x_device::subwf   },{1, &pic16x8x_device::decf    },{1, &pic16x8x_device::decf    }, // 04
	{1, &pic16x8x_device::iorwf   },{1, &pic16x8x_device::iorwf   },{1, &pic16x8x_device::andwf   },{1, &pic16x8x_device::andwf   }, // 08
	{1, &pic16x8x_device::xorwf   },{1, &pic16x8x_device::xorwf   },{1, &pic16x8x_device::addwf   },{1, &pic16x8x_device::addwf   }, // 0C
	{1, &pic16x8x_device::movf    },{1, &pic16x8x_device::movf    },{1, &pic16x8x_device::comf    },{1, &pic16x8x_device::comf    }, // 10
	{1, &pic16x8x_device::incf    },{1, &pic16x8x_device::incf    },{1, &pic16x8x_device::decfsz  },{1, &pic16x8x_device::decfsz  }, // 14
	{1, &pic16x8x_device::rrf     },{1, &pic16x8x_device::rrf     },{1, &pic16x8x_device::rlf     },{1, &pic16x8x_device::rlf     }, // 18
	{1, &pic16x8x_device::swapf   },{1, &pic16x8x_device::swapf   },{1, &pic16x8x_device::incfsz  },{1, &pic16x8x_device::incfsz  }, // 1C
	{1, &pic16x8x_device::bcf     },{1, &pic16x8x_device::bcf     },{1, &pic16x8x_device::bcf     },{1, &pic16x8x_device::bcf     }, // 20
	{1, &pic16x8x_device::bcf     },{1, &pic16x8x_device::bcf     },{1, &pic16x8x_device::bcf     },{1, &pic16x8x_device::bcf     },
	{1, &pic16x8x_device::bsf     },{1, &pic16x8x_device::bsf     },{1, &pic16x8x_device::bsf     },{1, &pic16x8x_device::bsf     }, // 28
	{1, &pic16x8x_device::bsf     },{1, &pic16x8x_device::bsf     },{1, &pic16x8x_device::bsf     },{1, &pic16x8x_device::bsf     },
	{1, &pic16x8x_device::btfsc   },{1, &pic16x8x_device::btfsc   },{1, &pic16x8x_device::btfsc   },{1, &pic16x8x_device::btfsc   }, // 30
	{1, &pic16x8x_device::btfsc   },{1, &pic16x8x_device::btfsc   },{1, &pic16x8x_device::btfsc   },{1, &pic16x8x_device::btfsc   },
	{1, &pic16x8x_device::btfss   },{1, &pic16x8x_device::btfss   },{1, &pic16x8x_device::btfss   },{1, &pic16x8x_device::btfss   }, // 38
	{1, &pic16x8x_device::btfss   },{1, &pic16x8x_device::btfss   },{1, &pic16x8x_device::btfss   },{1, &pic16x8x_device::btfss   },
	{2, &pic16x8x_device::call    },{2, &pic16x8x_device::call    },{2, &pic16x8x_device::call    },{2, &pic16x8x_device::call    }, // 40
	{2, &pic16x8x_device::call    },{2, &pic16x8x_device::call    },{2, &pic16x8x_device::call    },{2, &pic16x8x_device::call    },
	{2, &pic16x8x_device::call    },{2, &pic16x8x_device::call    },{2, &pic16x8x_device::call    },{2, &pic16x8x_device::call    }, // 48
	{2, &pic16x8x_device::call    },{2, &pic16x8x_device::call    },{2, &pic16x8x_device::call    },{2, &pic16x8x_device::call    },
	{2, &pic16x8x_device::goto_op },{2, &pic16x8x_device::goto_op },{2, &pic16x8x_device::goto_op },{2, &pic16x8x_device::goto_op }, // 50
	{2, &pic16x8x_device::goto_op },{2, &pic16x8x_device::goto_op },{2, &pic16x8x_device::goto_op },{2, &pic16x8x_device::goto_op },
	{2, &pic16x8x_device::goto_op },{2, &pic16x8x_device::goto_op },{2, &pic16x8x_device::goto_op },{2, &pic16x8x_device::goto_op }, // 58
	{2, &pic16x8x_device::goto_op },{2, &pic16x8x_device::goto_op },{2, &pic16x8x_device::goto_op },{2, &pic16x8x_device::goto_op },
	{1, &pic16x8x_device::movlw   },{1, &pic16x8x_device::movlw   },{1, &pic16x8x_device::movlw   },{1, &pic16x8x_device::movlw   }, // 60
	{1, &pic16x8x_device::movlw   },{1, &pic16x8x_device::movlw   },{1, &pic16x8x_device::movlw   },{1, &pic16x8x_device::movlw   },
	{2, &pic16x8x_device::retlw   },{2, &pic16x8x_device::retlw   },{2, &pic16x8x_device::retlw   },{2, &pic16x8x_device::retlw   }, // 68
	{2, &pic16x8x_device::retlw   },{2, &pic16x8x_device::retlw   },{2, &pic16x8x_device::retlw   },{2, &pic16x8x_device::retlw   },
	{1, &pic16x8x_device::iorlw   },{1, &pic16x8x_device::iorlw   },{1, &pic16x8x_device::andlw   },{1, &pic16x8x_device::andlw   }, // 70
	{1, &pic16x8x_device::xorlw   },{1, &pic16x8x_device::xorlw   },{1, &pic16x8x_device::xorlw   },{1, &pic16x8x_device::xorlw   }, // 74
	{1, &pic16x8x_device::sublw   },{1, &pic16x8x_device::sublw   },{1, &pic16x8x_device::sublw   },{1, &pic16x8x_device::sublw   }, // 78
	{1, &pic16x8x_device::addlw   },{1, &pic16x8x_device::addlw   },{1, &pic16x8x_device::addlw   },{1, &pic16x8x_device::addlw   }  // 7C
};

