mamedev/mame/src/devices/cpu/pic16x8x/pic16x8x.cpp
const pic16x8x_device::pic16x8x_opcode pic16x8x_device::s_opcode_00x[128]=
{
	{1, &pic16x8x_device::nop     },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   }, // 00
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },
	{2, &pic16x8x_device::retrn   },{2, &pic16x8x_device::retfie    },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   }, // 08
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   }, // 10
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   }, // 18
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },
	{1, &pic16x8x_device::nop     },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   }, // 20
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   }, // 28
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   }, // 30
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   }, // 38
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },
	{1, &pic16x8x_device::nop     },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   }, // 40
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   }, // 48
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   }, // 50
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   }, // 58
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },
	{1, &pic16x8x_device::nop     },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::sleepic   }, // 60
	{1, &pic16x8x_device::clrwdt  },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   }, // 68
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   }, // 70
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   }, // 78
	{1, &pic16x8x_device::illegal },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   },{1, &pic16x8x_device::illegal   }
};


/****************************************************************************
 *  Inits CPU emulation
 ****************************************************************************/

enum
{
	PIC16X8x_PC=1, PIC16X8x_W, PIC16X8x_ALU, PIC16X8x_WDT, PIC16X8x_PSCL, PIC16X8x_CONFIG
};

void pic16x8x_device::device_start()
{
	space(AS_PROGRAM).cache(m_program);
	space(AS_DATA).specific(m_data);

	m_program_mask = (1 << m_program_width) - 1;
	m_data_mask = 0xff;
	m_status_mask = 0xff;
	m_PCL = 0;
	m_PREVPC = 0;
	m_W = 0;
	m_OPTION = 0;
	m_ALU = 0;
	m_WDT = 0;
	m_TMR0 = 0;
	m_STATUS = ~m_status_mask;
	m_FSR = 0;
	std::fill(std::begin(m_port_data), std::end(m_port_data), 0);
	std::fill(std::begin(m_port_tris), std::end(m_port_tris), 0);
	std::fill(std::begin(m_STACK), std::end(m_STACK), 0);
	m_prescaler = 0;
	m_opcode.w = 0;
	m_delay_timer = 0;
	m_rtcc = 0;
	m_count_cycles = 0;
	m_inst_cycles = 0;
	m_stack_pointer = 0;
	m_debugger_temp = 0;
	m_portb_chdetect_temp = 0xff;
	m_irq_in_progress = false;

	// save states
	save_item(NAME(m_PCL));
	save_item(NAME(m_PREVPC));
	save_item(NAME(m_CONFIG));
	save_item(NAME(m_W));
	save_item(NAME(m_OPTION));
	save_item(NAME(m_ALU));
	save_item(NAME(m_WDT));
	save_item(NAME(m_TMR0));
	save_item(NAME(m_STATUS));
	save_item(NAME(m_FSR));
	save_item(NAME(m_port_data));
	save_item(NAME(m_port_tris));
	save_item(NAME(m_EEDATA));
	save_item(NAME(m_EEADR));
	save_item(NAME(m_EECON1));
	save_item(NAME(m_EECON2));
	save_item(NAME(m_PCLATH));
	save_item(NAME(m_INTCON));
	save_item(NAME(m_STACK));
	save_item(NAME(m_prescaler));
	save_item(NAME(m_opcode.w));
	save_item(NAME(m_delay_timer));
	save_item(NAME(m_rtcc));
	save_item(NAME(m_count_cycles));
	save_item(NAME(m_inst_cycles));
	save_item(NAME(m_stack_pointer));
	save_item(NAME(m_old_RB0));
	save_item(NAME(m_irq_in_progress));
	save_item(NAME(m_eeprom_data));
	

	// debugger
	state_add( PIC16X8x_PC,   "PC",   m_PCL).mask(0xfff).formatstr("%03X");
	state_add( PIC16X8x_W,    "W",    m_W).formatstr("%02X");
	state_add( PIC16X8x_ALU,  "ALU",  m_ALU).formatstr("%02X");
	state_add( PIC16X8x_WDT,  "WDT",  m_WDT).formatstr("%04X");
	state_add( PIC16X8x_CONFIG,  "CNF",  m_CONFIG).formatstr("%04X");
	state_add( PIC16X8x_PSCL, "PSCL", m_debugger_temp).callimport().formatstr("%3s");

	state_add( STATE_GENPC, "GENPC", m_PCL).noshow();
	state_add( STATE_GENPCBASE, "CURPC", m_PREVPC).noshow();
	state_add( STATE_GENFLAGS, "GENFLAGS", m_OPTION).formatstr("%13s").noshow();

	set_icountptr(m_icount);
}


