mamedev/mame/src/devices/cpu/pic16x8x/pic16x8x.cpp
void pic16x8x_device::state_import(const device_state_entry &entry)
{
	switch (entry.index())
	{
		case PIC16X8x_PSCL:
			m_prescaler = m_debugger_temp;
			break;
	}
}

void pic16x8x_device::state_export(const device_state_entry &entry)
{
	switch (entry.index())
	{
	}
}

void pic16x8x_device::state_string_export(const device_state_entry &entry, std::string &str) const
{
	switch (entry.index())
	{
		case PIC16X8x_PSCL:
			str = string_format("%c%02X", ((m_OPTION & 0x08) ? 'W' : 'T'), m_prescaler);
			break;

		case STATE_GENFLAGS:
			str = string_format("%01x%c%c%c%c%c %c%c%c%03x",
				(m_STATUS & 0xe0) >> 5,
				m_STATUS & 0x10 ? '.':'O',      // WDT Overflow
				m_STATUS & 0x08 ? 'P':'D',      // Power/Down
				m_STATUS & 0x04 ? 'Z':'.',      // Zero
				m_STATUS & 0x02 ? 'c':'b',      // Nibble Carry/Borrow
				m_STATUS & 0x01 ? 'C':'B',      // Carry/Borrow

				m_OPTION & 0x20 ? 'C':'T',    // Counter/Timer
				m_OPTION & 0x10 ? 'N':'P',    // Negative/Positive
				m_OPTION & 0x08 ? 'W':'T',    // WatchDog/Timer
				m_OPTION & 0x08 ? (1<<(m_OPTION&7)) : (2<<(m_OPTION&7)));
			break;
	}
}


/****************************************************************************
 *  Reset registers to their initial values
 ****************************************************************************/

void pic16x8x_device::reset_regs()
{
	set_pc(RESET_VECTOR);
	m_port_tris[PORTA] = 0x1f;
	m_port_tris[PORTB] = 0xff;
	m_OPTION = T0CS_FLAG | T0SE_FLAG | PSA_FLAG | PS_REG;
	m_PREVPC = m_PCL;
	m_STATUS = 0x18;
	m_PCL = 0;
	m_prescaler = 0;
	m_delay_timer = 0;
	m_inst_cycles = 0;
	m_count_cycles = 0;
	m_stack_pointer = 0;
	m_portb_chdetect_temp = 0xff;
	m_old_RB0 = 0;
}

void pic16x8x_device::set_config(u16 data)
{
	logerror("Writing %04x to the PIC16x8x configuration bits\n", data);
	m_CONFIG = (data & 0x3fff);
}

void pic16x8x_device::watchdog_reset()
{
	SET(m_STATUS, TO_FLAG | PD_FLAG | Z_FLAG | DC_FLAG | C_FLAG);
	reset_regs();
}

void pic16x8x_device::device_reset()
{
	reset_regs();
	CLR(m_STATUS, RP0_FLAG);
	CLR(m_STATUS, RP1_FLAG);

	// Setting TO_FLAG from Config Word
	if(WDTE)
		SET(m_STATUS, TO_FLAG);
	else
		CLR(m_STATUS, TO_FLAG);

	SET(m_STATUS, PD_FLAG);
	store_regfile(3, m_STATUS);
	store_regfile(4, m_FSR);
}


/****************************************************************************
 *  WatchDog
 ****************************************************************************/

void pic16x8x_device::update_watchdog(int counts)
{
	/*
	WatchDog is set up to count 18,000 (0x464f hex) ticks to provide
	the timeout period of 0.018ms based on a 4MHz input clock.
	Note: the 4MHz clock should be divided by the PIC16C5x_CLOCK_DIVIDER
	which effectively makes the PIC run at 1MHz internally.

	If the current instruction is CLRWDT or SLEEP, don't update the WDT
	*/

	if ((m_opcode.w != 3) && (m_opcode.w != 4))
	{
		u16 old_WDT = m_WDT;

		m_WDT -= counts;

		if (m_WDT > 0x464f)
		{
			m_WDT = 0x464f - (0xffff - m_WDT);
		}

		if (((old_WDT != 0) && (old_WDT < m_WDT)) || (m_WDT == 0))
		{
			if (PSA)
			{
				m_prescaler++;
				if (m_prescaler >= (1 << PS))
				{ // Prescale values from 1 to 128
					m_prescaler = 0;
					CLR(m_STATUS, TO_FLAG);
					watchdog_reset();
				}
			}
			else
			{
				CLR(m_STATUS, TO_FLAG);
				watchdog_reset();
			}
		}
	}
}


/****************************************************************************
 *  Update Timer
 ****************************************************************************/

void pic16x8x_device::update_timer(int counts)
{
	if (m_delay_timer > 0)
	{ // Timer increment is inhibited
		int dt = m_delay_timer;
		m_delay_timer -= m_inst_cycles;
		counts -= dt;
	}

	if (m_delay_timer > 0 || counts <= 0)
		return;

	if (PSA == 0)
	{   // if PSA is cleared, prescaler is assigned to timer
		m_prescaler += counts;
		if (m_prescaler >= (2 << PS))
		{ // Prescale values from 2 to 256
			m_TMR0 += (m_prescaler / (2 << PS));
			if(m_TMR0 == 0)
				SET(m_INTCON, T0IF_FLAG);
			m_prescaler %= (2 << PS); // Overflow prescaler
		}
	}
	else
	{
		m_TMR0 += counts;
		if(m_TMR0 == 0)
			SET(m_INTCON, T0IF_FLAG);
	}
}

void pic16x8x_device::execute_set_input(int line, int state)
{
	u8 RB0_in;
	switch (line)
	{
		// RTCC/RA4_T0CKI pin
		case PIC16x8x_T0CKI:
			if (T0CS && state != m_rtcc)
			{ // Count mode, edge triggered
				if ((T0SE && !state) || (!T0SE && state))
					m_count_cycles++;
			}
			m_rtcc = state;
			break;

		case PIC16x8x_RB0INT:
			RB0_in = state;
			if (INTEDG)
			{   /* Interrupt on Rising edge RB0 input */
				if (RISING_EDGE_RB0)
				{
					SET(m_INTCON, INTF_FLAG);
				}
			}
			else
			{   /* Interrupt on Falling edge RB0 input */
				if (FALLING_EDGE_RB0)
				{
					SET(m_INTCON, INTF_FLAG);
				}
			}
			m_old_RB0 = RB0_in;
			break;

		default:
			break;
	}
}

/*-------------------------------------------------
    check_irqs - check for and process IRQs
-------------------------------------------------*/

void pic16x8x_device::check_irqs()
{
	// if something is in progress, we do nothing
	if (m_irq_in_progress)
		return;

	if(m_read_port[PORTB](PORTB, 0xf0) != m_portb_chdetect_temp)
	{
		m_portb_chdetect_temp = m_read_port[PORTB](PORTB, 0xf0);
		SET(m_INTCON, RBIF_FLAG);
	}

	else if(GIE && RBIE && RBIF)
	{
		push_stack(m_PCL);
		set_pc(INT_VECTOR);
		standard_irq_callback(0, m_PCL);
		m_irq_in_progress = true;
	}

	else if(GIE && INTE && INTF)
	{
		push_stack(m_PCL);
		set_pc(INT_VECTOR);
		standard_irq_callback(1, m_PCL);
		m_irq_in_progress = true;
	}

	else if(GIE && T0IE && T0IF)
	{
		push_stack(m_PCL);
		set_pc(INT_VECTOR);
		standard_irq_callback(2, m_PCL);
		m_irq_in_progress = true;
	}
	
	else if(GIE && EEIE && EEIF)
	{
		push_stack(m_PCL);
		set_pc(INT_VECTOR);
		standard_irq_callback(3, m_PCL);
		m_irq_in_progress = true;
	}
}


/****************************************************************************
 *  Execute IPeriod. Return 0 if emulation should be stopped
 ****************************************************************************/

void pic16x8x_device::execute_run()
{
	do
	{
		// check interrupts
		check_irqs();

		if (PD == 0)
		{ // Sleep Mode
			m_count_cycles = 0;
			m_inst_cycles = 1;
			debugger_instruction_hook(m_PCL);
		}
		else
		{
			m_PREVPC = m_PCL;

			debugger_instruction_hook(m_PCL);

			m_opcode.w = m_program.read_word(m_PCL);
			set_pc(m_PCL + 1);

			if ( (m_opcode.w & 0x3f80) != 0x0000)
			{ // Do all opcodes except the 00? ones
				m_inst_cycles = s_opcode_main[((m_opcode.w >> 7) & 0x7f)].cycles;
				(this->*s_opcode_main[((m_opcode.w >> 7) & 0x7f)].function)();
			}
			else
			{ // Opcode 0x00? has many opcodes in its minor nibble
				m_inst_cycles = s_opcode_00x[(m_opcode.b.l & 0x7f)].cycles;
				(this->*s_opcode_00x[(m_opcode.b.l & 0x7f)].function)();
			}

			update_timer(T0CS ? m_count_cycles : m_inst_cycles);
			m_count_cycles = 0;
		}

		if (WDTE)
		{
			update_watchdog(m_inst_cycles);
		}

		m_icount -= m_inst_cycles;

	} while (m_icount > 0);
}
